tap "aws/tap"
tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "schniz/tap"
brew "ack"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "openssl@1.1"
brew "asdf"
brew "python"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "gitleaks"
brew "graphviz"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jq"
brew "ncdu"
brew "pidcat"
brew "pkg-config"
brew "postgresql", restart_service: true
brew "pyenv"
brew "scrcpy"
brew "transcrypt"
brew "tree"
brew "watchman"
brew "zsh"
brew "aws/tap/aws-sam-cli"
brew "heroku/brew/heroku"
brew "schniz/tap/fnm"
cask "amethyst"
cask "android-platform-tools"
cask "bettertouchtool"
cask "dbeaver-community"
cask "fastlane"
cask "font-source-code-pro"
cask "franz"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "java"
cask "macpass"
cask "mobster"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zeplin"
